In [1]:
import pandas as pd

In [4]:
df_shopping = pd.read_csv("shopping_data.csv")
df_shopping.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [6]:
df_shopping.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [9]:
df_shopping.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [12]:
df_shopping.count()

CustomerID                203
Card Member               201
Age                       201
Annual Income             203
Spending Score (1-100)    202
dtype: int64

In [15]:
for column in df_shopping.columns:
    print(f"Column {column} has {df_shopping[column].isnull().sum()} null vales")

Column CustomerID has 0 null vales
Column Card Member has 2 null vales
Column Age has 2 null vales
Column Annual Income has 0 null vales
Column Spending Score (1-100) has 1 null vales

In [16]:
df_shopping = df_shopping.dropna()

In [18]:
df_shopping.count()

CustomerID                200
Card Member               200
Age                       200
Annual Income             200
Spending Score (1-100)    200
dtype: int64

In [21]:
df_shopping.duplicated().count()

200

In [22]:
df_shopping.drop(columns=["CustomerID"], axis=1, inplace=True)

In [23]:
df_shopping

    Card Member   Age  Annual Income  Spending Score (1-100)
0           Yes  19.0          15000                    39.0
1           Yes  21.0          15000                    81.0
2            No  20.0          16000                     6.0
3            No  23.0          16000                    77.0
4            No  31.0          17000                    40.0
..          ...   ...            ...                     ...
198          No  35.0         120000                    79.0
199          No  45.0         126000                    28.0
200         Yes  32.0         126000                    74.0
201         Yes  32.0         137000                    18.0
202         Yes  30.0         137000                    83.0

[200 rows x 4 columns]

In [24]:
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0

In [25]:
df_shopping["Card Member"] = df_shopping["Card Member"].apply(change_string)

In [26]:
df_shopping

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0          15000                    39.0
1              1  21.0          15000                    81.0
2              0  20.0          16000                     6.0
3              0  23.0          16000                    77.0
4              0  31.0          17000                    40.0
..           ...   ...            ...                     ...
198            0  35.0         120000                    79.0
199            0  45.0         126000                    28.0
200            1  32.0         126000                    74.0
201            1  32.0         137000                    18.0
202            1  30.0         137000                    83.0

[200 rows x 4 columns]

In [27]:
df_shopping["Annual Income"] = df_shopping["Annual Income"]/1000

In [28]:
df_shopping

     Card Member   Age  Annual Income  Spending Score (1-100)
0              1  19.0           15.0                    39.0
1              1  21.0           15.0                    81.0
2              0  20.0           16.0                     6.0
3              0  23.0           16.0                    77.0
4              0  31.0           17.0                    40.0
..           ...   ...            ...                     ...
198            0  35.0          120.0                    79.0
199            0  45.0          126.0                    28.0
200            1  32.0          126.0                    74.0
201            1  32.0          137.0                    18.0
202            1  30.0          137.0                    83.0

[200 rows x 4 columns]

In [30]:
# Saving the Cleaned Data

df_shopping.to_csv("Cleaned_Shopping_Data.csv", index=False)